index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-30 Fri 15:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ERS-ZMQ</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ERS-ZMQ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org07b09fb">Install</a></li>
<li><a href="#orgc1d46ca">Running</a></li>
<li><a href="#org2068f60">Configuring</a></li>
<li><a href="#org45c285c">Testing</a>
<ul>
<li><a href="#org1ae42ce">ERS to ZeroMQ</a></li>
<li><a href="#orge690569">ERS to ERS</a></li>
<li><a href="#orgde97df9">ZeroMQ to ERS</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This provides an ERS plugin which will send ERS Issues over ZeroMQ
streams.
</p>

<p>
It is still a work in progress.
</p>

<div id="outline-container-org07b09fb" class="outline-2">
<h2 id="org07b09fb">Install</h2>
<div class="outline-text-2" id="text-org07b09fb">
<p>
This requires libzmq 4.3.3 or newer and with draft features
(<code>--enable-draft</code> option to configure).  With <a href="https://dune-daq.github.io/dunedaq-spack/">DUNE DAQ Spack</a>, <code>spack
install libzmq@4.3.3+draft</code> will do.  
</p>

<p>
To install the ERS-ZMQ plugin one may do:
</p>

<pre class="example">
$ waf --prefix=/path/to/install configure 
$ waf
$ waf install
</pre>

<p>
If the automatic location fails, dependencies can be given with
<code>--with-*</code> flags.  See <code>waf --help</code>.
</p>
</div>
</div>

<div id="outline-container-orgc1d46ca" class="outline-2">
<h2 id="orgc1d46ca">Running</h2>
<div class="outline-text-2" id="text-orgc1d46ca">
<p>
ERS-ZMQ is an ERS plugin.  It is meant to run with some existing
application that uses ERS and with no compilation.  ERS finds its
plugins using two environment variables:
</p>

<pre class="example">
export TDAQ_ERS_STREAM_LIBS=ers-zmq
export LD_LIBRARY_FLAGS=/path/to/install/lib:$LD_LIBRARY_FLAGS
</pre>

<p>
ERS plugins are activated by another environment variable.  For
example:
</p>

<pre class="example">
export TDAQ_ERS_INFO="lstderr,ezout(&lt;spec&gt;)"
</pre>

<p>
Where <code>&lt;spec&gt;</code> is an ERS-ZMQ specification described in the next
section.
</p>
</div>
</div>

<div id="outline-container-org2068f60" class="outline-2">
<h2 id="org2068f60">Configuring</h2>
<div class="outline-text-2" id="text-org2068f60">
<p>
ERS-ZMQ provides an ERS output stream called <code>ezout</code> and an input stream
called <code>ezin</code> (fixme: tbd).  Both require a specification describing how
one or more the ZeroMQ sockets should be configured.  It is up to the
user to assure that all endpoints are consistently configured.
</p>

<p>
The <code>&lt;spec&gt;</code> is a very flexible micro-language to specify ZeroMQ
sockets.  It is a comma, space or newline separated list of URLs or
file names.  The URL is any ZeroMQ URL with an extension to specify
query parameters.  A named file may contain a <code>&lt;spec&gt;</code>.  Note, this is
may be recursive so that one file may include an element of a spec
that names other files.
</p>

<p>
The URL query parameter extension to the ZeroMQ address URLs supports
these parameters:
</p>

<dl class="org-dl">
<dt>type</dt><dd>the ZeroMQ socket type as a case-insensitive string (eg, "pub" or "pull").  By default a sender will use PUB and a receiver will use SUB.</dd>
<dt>borc</dt><dd>whether the socket should <code>bind()</code> or <code>connect()</code> to the associated address.  By default a sender will "bind" and a receiver will "connect".</dd>
<dt>name</dt><dd>a string identifier that collects multiple addresses to the same socket.  By default it is an empty string.</dd>
<dt>fmt</dt><dd>the message format (fixme: for now just JSON, soon MessagePack).</dd>
<dt>topic</dt><dd>a prefix match for a subscription topic applicable if <b>type</b> is "sub" (fixme: not yet implemented, default empty topic is subscribed)</dd>
</dl>

<p>
Examples
</p>

<pre class="example">
tcp://127.0.0.1:12345/?borc=connect&amp;type=push&amp;name=logz,ipc://fooo.fifo/?name=logz
tcp://127.0.0.1:12346/?borc=bind&amp;type=pub&amp;name=broadcast
yet-more-specs.txt
probably-example-is-getting-excessive.txt
</pre>
</div>
</div>

<div id="outline-container-org45c285c" class="outline-2">
<h2 id="org45c285c">Testing</h2>
<div class="outline-text-2" id="text-org45c285c">
</div>
<div id="outline-container-org1ae42ce" class="outline-3">
<h3 id="org1ae42ce">ERS to ZeroMQ</h3>
<div class="outline-text-3" id="text-org1ae42ce">
<p>
In one terminal run a test app that generates ERS Issues
</p>

<pre class="example">
$ LD_LIBRARY_PATH=$LD_LIBRARY_PATH:`pwd`/build
$ export DAQ_ERS_STREAM_LIBS=ers-zmq 
$ export TDAQ_ERS_INFO="lstderr,ezout(tcp://127.0.0.1:12345/)"
$ ./build/test_send
</pre>

<p>
In another terminal run a generic ZeroMQ (non-ERS) app to catch Issue messages:
</p>

<pre class="example">
$ ./build/test_ez_recv tcp://127.0.0.1:12345 10
</pre>
</div>
</div>

<div id="outline-container-orge690569" class="outline-3">
<h3 id="orge690569">ERS to ERS</h3>
<div class="outline-text-3" id="text-orge690569">
<p>
It is possible to link an <code>ezout</code> to an <code>ezin</code>.
</p>

<p>
t.b.d.
</p>
</div>
</div>

<div id="outline-container-orgde97df9" class="outline-3">
<h3 id="orgde97df9">ZeroMQ to ERS</h3>
<div class="outline-text-3" id="text-orgde97df9">
<p>
It is possible to inject messages from arbitrary ZeroMQ application to an <code>ezin</code>.
</p>

<p>
t.b.d.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2020-10-30 Fri 15:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
